---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.ResultAffectedByCrop
enum: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.ResultAffectedByCrop

The view has an active crop region set. If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains no points,
 no path of travel was found inside the crop region, but a valid path may exist outside of it.
 If [!:Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop] contains valid points, a path of travel was found inside the
 crop region, but a better option may exist outside of it.